let dataArray = {
    student__info: {
        name: 'ছাত্রছাত্রীদের তথ্য',
        img__src: '/menu01.jpg',
        values: [
            {value: "ভর্তি তথ্য", src: "/"}, 
            {value: "ছাত্রছাত্রীর আসন সংখ্যা", src: "/"}, 
            {value: "নোটিশ", src: "/"}, 
            {value: "রুটিন", src: "/"}, 
            {value: "কৃতি শিক্ষার্থী", src: "/"}, 
        ]
    },
    teacher__info: {
        name: 'অধ্যাক্ষের দপ্তর',
        img__src: '/menu01.jpg',
        values: [
            {value: "শিক্ষকগণের শূন্য পদের তালিকা", src: "/"}, 
            {value: "কর্মচারীর  শূন্য পদের তালিকা", src: "/"}, 
            {value: "শিক্ষক তালিকা ডাউনলোড", src: "/"}, 
            {value: "প্রাক্তন প্রধান শিক্ষক", src: "/"}, 
            {value: "পরিচালনা পরিষদ", src: "/"}, 
            {value: "কর্মচারীদের তথ্য", src: "/"}
        ]
    },
    download__info: {
        name: 'ডাউনলোড',
        img__src: '/menu01.jpg',
        values: [
            {value: "১ম সাময়িকি পরীক্ষার রুটিন ডাউনলোড", src: "/"}, 
            {value: "এসএসসি পরীক্ষার রুটিন ডাউনলোড", src: "/"}, 
            {value: "ছুটির নোটিশ ডাউনলোড", src: "/"}, 
            {value: "ভর্তি ফরম ডাউনলোড", src: "/"}, 
            {value: "পরীক্ষার রুটিন ডাউনলোড", src: "/"}, 
        ]
    },
    institute__info: {
        name: 'একাডেমীক তথ্য',
        img__src: '/menu01.jpg',
        values: [
            {value: "কক্ষ সংখ্যা", src: "/"}, 
            {value: "ছাত্রছাত্রীর আসন সংখ্যা", src: "/"}, 
            {value: "ছুটির তালিকা", src: "/"}, 
            {value: "মাল্টিমিডিয়া ক্লাসরুম", src: "/"}, 
            {value: "যানবাহন সুবিধা", src: "/"}, 
        ]
    },
    suborno__info: {
        name: 'স্বাধীনতার সুবর্ণজয়ন্তী',
        img__src: '/suborno__joyonti.png',
        values: [
            {value: "সুবর্ণজয়ন্তীর কার্যক্রম", src: "/"}, 
            {value: "আদেশ / নোটিশ", src: "/"}, 
            {value: "ছবি গ্যালারি", src: "/"}, 
            {value: "ভিডিও", src: "/"},  
        ]
    }, 
    institute__details: {
        id: 0,
        img__src: "/home__banner.jpg",
        name: "প্রতিষ্ঠানের ইতিহাস", 
        url:'/details/institute',
        text: `অর্থহীন লেখা যার মাঝে আছে অনেক কিছু। হ্যাঁ, এই লেখার মাঝেই আছে অনেক কিছু। যদি তুমি মনে করো, এটা তোমার কাজে লাগবে, তাহলে তা লাগবে কাজে। নিজের ভাষায় লেখা দেখতে অভ্যস্ত হও। মনে রাখবে লেখা অর্থহীন হয়, যখন তুমি তাকে অর্থহীন মনে করো; আর লেখা অর্থবোধকতা তৈরি করে, যখন তুমি তাতে অর্থ ঢালো। যেকোনো লেখাই তোমার কাছে অর্থবোধকতা তৈরি করতে পারে, যদি তুমি সেখানে অর্থদ্যোতনা দেখতে পাও। ছিদ্রান্বেষণ? না, তা হবে কেন? যে কথাকে কাজে লাগাতে চাও, তাকে কাজে লাগানোর কথা চিন্তা করার আগে ভাবো, তুমি কি সেই কথার জাদুতে আচ্ছন্ন হয়ে গেছ কিনা। তুমি যদি নিশ্চিত হও যে, তুমি কোনো মোহাচ্ছাদিত আবহে আবিষ্ট হয়ে অন্যের শেখানো বুলি আত্মস্থ করছো না, তাহলে তুমি নির্ভয়ে, নিশ্চিন্তে অগ্রসর হও। তুমি সেই কথাকে জানো, বুঝো, আত্মস্থ করো; মনে রাখবে, যা অনুসরণ করতে চলেছো, তা আগে অনুধাবন করা জরুরি; এখানে কিংকর্তব্যবিমূঢ় হবার কোনো সুযোগ নেই। কোনো কথা শোনামাত্রই কি তুমি তা বিশ্বাস করবে? হয়তো বলবে, করবে, হয়তো বলবে “আমি করবো না।” হ্যা, “আমি করবো না” বললেই সবকিছু অস্বীকার করা যায় না, হয়তো তুমি মনের গহীন গভীর থেকে ঠিকই বিশ্বাস করতে শুরু করেছো সেই কথাটি, কিন্তু মুখে অস্বীকার করছো। তাই সচেতন থাকো, তুমি কী ভাবছো— তার প্রতি; সচেতন থাকো, তুমি কি আসলেই বিশ্বাস করতে চলেছো ঐ কথাটি… শুধু এতটুকু বলি, যা-ই বিশ্বাস করো না কেন, আগে যাচাই করে নাও; আর এতে চাই তোমার প্রত্যুৎপন্নমতিত্ব। তাই কোন কথাটি কাজে লাগবে, তা নির্ধারণ করবে তুমি— হ্যাঁ, তুমি। হয়তো সামান্য ক’টা বাংলা অক্ষর: খন্ড-ত, অনুস্বার, বিঃসর্গ কিংবা চন্দ্রবিন্দু— কিন্তু যদি তুমি বিশ্বাস করো, তাহলে হয়তো তুমি তা দিয়েই তৈরি করতে পারো এক উচ্চমার্গীয় মহাকাব্য- এক চিরসবুজ অর্ঘ্য। রচিত হতে পারে পৃথিবীর ১ম বিরাম চিহ্নের ইতিকথা – এক নতুন ঊষা। …মহাকাব্য লিখতে ঋষি-মুনি হওয়া লাগে না। অর্থহীনতা আর অর্থদ্যোতনার সেই ঈর্ষাকাতর মোহাবিষ্টতা তাই তৈরি করে নাও নিজের মাঝে- চাই একটুখানি ঔৎসুক্য। নিজেই ঠিক করো, নিজের ভাষাটা কি অর্থহীন, নাকি কিছু সত্যিই বলছে!`
    },
    principal__details: {
        id: 1,
        img__src: "/main.gif",
        name: "অধ্যক্ষের বাণী",
        url:'/details/institute',
        text: `অর্থহীন লেখা যার মাঝে আছে অনেক কিছু। হ্যাঁ, এই লেখার মাঝেই আছে অনেক কিছু। যদি তুমি মনে করো, এটা তোমার কাজে লাগবে, তাহলে তা লাগবে কাজে। নিজের ভাষায় লেখা দেখতে অভ্যস্ত হও। মনে রাখবে লেখা অর্থহীন হয়, যখন তুমি তাকে অর্থহীন মনে করো; আর লেখা অর্থবোধকতা তৈরি করে, যখন তুমি তাতে অর্থ ঢালো। যেকোনো লেখাই তোমার কাছে অর্থবোধকতা তৈরি করতে পারে, যদি তুমি সেখানে অর্থদ্যোতনা দেখতে পাও। ছিদ্রান্বেষণ? না, তা হবে কেন? যে কথাকে কাজে লাগাতে চাও, তাকে কাজে লাগানোর কথা চিন্তা করার আগে ভাবো, তুমি কি সেই কথার জাদুতে আচ্ছন্ন হয়ে গেছ কিনা। তুমি যদি নিশ্চিত হও যে, তুমি কোনো মোহাচ্ছাদিত আবহে আবিষ্ট হয়ে অন্যের শেখানো বুলি আত্মস্থ করছো না, তাহলে তুমি নির্ভয়ে, নিশ্চিন্তে অগ্রসর হও। তুমি সেই কথাকে জানো, বুঝো, আত্মস্থ করো; মনে রাখবে, যা অনুসরণ করতে চলেছো, তা আগে অনুধাবন করা জরুরি; এখানে কিংকর্তব্যবিমূঢ় হবার কোনো সুযোগ নেই। কোনো কথা শোনামাত্রই কি তুমি তা বিশ্বাস করবে? হয়তো বলবে, করবে, হয়তো বলবে “আমি করবো না।” হ্যা, “আমি করবো না” বললেই সবকিছু অস্বীকার করা যায় না, হয়তো তুমি মনের গহীন গভীর থেকে ঠিকই বিশ্বাস করতে শুরু করেছো সেই কথাটি, কিন্তু মুখে অস্বীকার করছো। তাই সচেতন থাকো, তুমি কী ভাবছো— তার প্রতি; সচেতন থাকো, তুমি কি আসলেই বিশ্বাস করতে চলেছো ঐ কথাটি… শুধু এতটুকু বলি, যা-ই বিশ্বাস করো না কেন, আগে যাচাই করে নাও; আর এতে চাই তোমার প্রত্যুৎপন্নমতিত্ব। তাই কোন কথাটি কাজে লাগবে, তা নির্ধারণ করবে তুমি— হ্যাঁ, তুমি। হয়তো সামান্য ক’টা বাংলা অক্ষর: খন্ড-ত, অনুস্বার, বিঃসর্গ কিংবা চন্দ্রবিন্দু— কিন্তু যদি তুমি বিশ্বাস করো, তাহলে হয়তো তুমি তা দিয়েই তৈরি করতে পারো এক উচ্চমার্গীয় মহাকাব্য- এক চিরসবুজ অর্ঘ্য। রচিত হতে পারে পৃথিবীর ১ম বিরাম চিহ্নের ইতিকথা – এক নতুন ঊষা। …মহাকাব্য লিখতে ঋষি-মুনি হওয়া লাগে না। অর্থহীনতা আর অর্থদ্যোতনার সেই ঈর্ষাকাতর মোহাবিষ্টতা তাই তৈরি করে নাও নিজের মাঝে- চাই একটুখানি ঔৎসুক্য। নিজেই ঠিক করো, নিজের ভাষাটা কি অর্থহীন, নাকি কিছু সত্যিই বলছে!`
    },
    second__principal__details: {
        id: 2,
        img__src: "/second.gif",
        name: "উপধ্যক্ষের বাণী",
        url:'/details/institute',
        text: `অর্থহীন লেখা যার মাঝে আছে অনেক কিছু। হ্যাঁ, এই লেখার মাঝেই আছে অনেক কিছু। যদি তুমি মনে করো, এটা তোমার কাজে লাগবে, তাহলে তা লাগবে কাজে। নিজের ভাষায় লেখা দেখতে অভ্যস্ত হও। মনে রাখবে লেখা অর্থহীন হয়, যখন তুমি তাকে অর্থহীন মনে করো; আর লেখা অর্থবোধকতা তৈরি করে, যখন তুমি তাতে অর্থ ঢালো। যেকোনো লেখাই তোমার কাছে অর্থবোধকতা তৈরি করতে পারে, যদি তুমি সেখানে অর্থদ্যোতনা দেখতে পাও। ছিদ্রান্বেষণ? না, তা হবে কেন? যে কথাকে কাজে লাগাতে চাও, তাকে কাজে লাগানোর কথা চিন্তা করার আগে ভাবো, তুমি কি সেই কথার জাদুতে আচ্ছন্ন হয়ে গেছ কিনা। তুমি যদি নিশ্চিত হও যে, তুমি কোনো মোহাচ্ছাদিত আবহে আবিষ্ট হয়ে অন্যের শেখানো বুলি আত্মস্থ করছো না, তাহলে তুমি নির্ভয়ে, নিশ্চিন্তে অগ্রসর হও। তুমি সেই কথাকে জানো, বুঝো, আত্মস্থ করো; মনে রাখবে, যা অনুসরণ করতে চলেছো, তা আগে অনুধাবন করা জরুরি; এখানে কিংকর্তব্যবিমূঢ় হবার কোনো সুযোগ নেই। কোনো কথা শোনামাত্রই কি তুমি তা বিশ্বাস করবে? হয়তো বলবে, করবে, হয়তো বলবে “আমি করবো না।” হ্যা, “আমি করবো না” বললেই সবকিছু অস্বীকার করা যায় না, হয়তো তুমি মনের গহীন গভীর থেকে ঠিকই বিশ্বাস করতে শুরু করেছো সেই কথাটি, কিন্তু মুখে অস্বীকার করছো। তাই সচেতন থাকো, তুমি কী ভাবছো— তার প্রতি; সচেতন থাকো, তুমি কি আসলেই বিশ্বাস করতে চলেছো ঐ কথাটি… শুধু এতটুকু বলি, যা-ই বিশ্বাস করো না কেন, আগে যাচাই করে নাও; আর এতে চাই তোমার প্রত্যুৎপন্নমতিত্ব। তাই কোন কথাটি কাজে লাগবে, তা নির্ধারণ করবে তুমি— হ্যাঁ, তুমি। হয়তো সামান্য ক’টা বাংলা অক্ষর: খন্ড-ত, অনুস্বার, বিঃসর্গ কিংবা চন্দ্রবিন্দু— কিন্তু যদি তুমি বিশ্বাস করো, তাহলে হয়তো তুমি তা দিয়েই তৈরি করতে পারো এক উচ্চমার্গীয় মহাকাব্য- এক চিরসবুজ অর্ঘ্য। রচিত হতে পারে পৃথিবীর ১ম বিরাম চিহ্নের ইতিকথা – এক নতুন ঊষা। …মহাকাব্য লিখতে ঋষি-মুনি হওয়া লাগে না। অর্থহীনতা আর অর্থদ্যোতনার সেই ঈর্ষাকাতর মোহাবিষ্টতা তাই তৈরি করে নাও নিজের মাঝে- চাই একটুখানি ঔৎসুক্য। নিজেই ঠিক করো, নিজের ভাষাটা কি অর্থহীন, নাকি কিছু সত্যিই বলছে!`
    },
    
    side__top__info:  [
        {value: "ভর্তি তথ্য", src: '/'},
        {value: "ভর্তি ফরম", src: '/'},
        {value: "ফটো গ্যালারী", src: '/'},
        {value: "ভিডিও গ্যালারী", src: '/'},
    ],
    official__link__info: {
        name: 'অফিসিয়াল লিংক',
        values: [
            {
                "value": "শিক্ষা মন্ত্রণালয়",
                "src": "http://www.moedu.gov.bd/"
            },
            {
                "value": "এসএসসি/এইচএসসি ফলাফল",
                "src": "http://www.educationboardresults.gov.bd/"
            },
            {
                "value": "ব্যানবেইজ",
                "src": "http://banbeis.gov.bd/new/"
            },
            {
                "value": "সেকায়েপ",
                "src": "http://www.seqaep.gov.bd/"
            }
        ]},
        
    e__sheba__link__info: {
        name: 'ই-সেবা',
        values: [
            {
                "value": "এইচএসসি/আলিম/সমমান পরীক্ষার ফরম পূরণ ফি পরিশোধ করুন এখান থেকে",
                "src": "https://sbl.com.bd:7070/BoardFee/Fee/"
            },
            {
                "value": "২০২১ সালের এইচএসসি পরীক্ষার্থী নিশ্চয়ন(কলেজ কর্তৃক)",
                "src": "http://app.rajshahiboard.gov.bd/tc/"
            },
            {
                "value": "কোভিড-১৯ টিকা রেজিস্ট্রেশন করুন এখান থেকে",
                "src": "https://surokkha.gov.bd/enroll"
            },
            {
                "value": "গুগুল ডকসে কলেজ কর্তৃক তথ্য প্রেরণ লিংক",
                "src": "https://docs.google.com/forms/d/1LxuPU4u3E0GZJS9StEDvGVG74_lbNKPjtmHoZVPscrM/viewform?edit_requested=true"
            },
            {
                "value": "এমপিও সিট / টপ সিট / পেমেন্ট ভাউচার রিপোর্ট",
                "src": "https://dshe.portal.gov.bd/site/page/8c09e774-ac65-47df-862e-27a78b0c112d"
            },
            {
                "value": "একাদশ শ্রেণীতে ভর্তির জন্য বোর্ড কর্তৃক অনলাইন আবেদনের লিংক",
                "src": "http://www.xiclassadmission.gov.bd/"
            },
            {
                "value": "বোর্ড ফলাফল",
                "src": "https://eboardresults.com/v2/home"
            },
            {
                "value": "জন্ম নিবন্ধন তথ্য যাচাই",
                "src": "https://everify.bdris.gov.bd/"
            },
            {
                "value": "ডিগ্রী ফরম ফিলাপ",
                "src": "http://www.nubd.info/degree-pass/"
            },
            {
                "value": "ডিগ্রী(পাস) শিক্ষার্থীদের প্রধানমন্ত্রীর শিক্ষা সহায়তা ট্রস্টি আবেদন",
                "src": "http://estipend.pmeat.gov.bd/#/"
            },
            {
                "value": "সমন্বিত উপবৃত্তি(প্রধানমন্ত্রীর শিক্ষা সহায়তা টাস্ট) আবেদন লিংক",
                "src": "http://hspbd.com/HSP-MIS/login?lang=en"
            },
            {
                "value": "ভোটার তথ্য(NID) যাচাই করুন এখান থেকে",
                "src": "https://services.nidw.gov.bd/nid-pub/voter-info"
            }
        ]},
    important__link__info: {
        name: 'গুরুত্বপূর্ণ তথ্য',
        values: [
            {
                "value": "ই-বুক",
                "src": "http://www.ebook.gov.bd/"
            },
            {
                "value": "শিক্ষক বাতায়ন",
                "src": "https://www.teachers.gov.bd/"
            },
            {
                "value": "মাল্টিমিডিয়া ক্লাসরুম ম্যানেজমেন্ট",
                "src": "http://mmc.e-service.gov.bd/"
            },
                {
                    "value": "শিক্ষা মন্ত্রনালয়",
                    "src": "http://www.moedu.gov.bd/"
                },
                {
                    "value": "মাধ্যমিক ও উচ্চমাধ্যমিক শিক্ষা বোর্ড, ঢাকা",
                    "src": "http://www.dhakaeducationboard.gov.bd/"
                },
                {
                    "value": "জাতীয় বিশ্ববিদ্যালয়",
                    "src": "http://www.nu.ac.bd/"
                },
                {
                    "value": "মাধ্যমিক ও উচ্চ শিক্ষা বিভাগ, শিক্ষা মন্ত্রালয়",
                    "src": "http://www.shed.gov.bd/"
                },
                {
                    "value": "প্রধানমন্ত্রীর শিক্ষা সহায়তা ট্রাস্ট",
                    "src": "http://www.pmeat.gov.bd/"
                },
                {
                    "value": "প্রধানমন্ত্রীর কার্যালয়",
                    "src": "http://www.pmo.gov.bd/"
                },
                {
                    "value": "মন্ত্রীপরিষদ বিভাগ",
                    "src": "http://www.cabinet.gov.bd/"
                },
                {
                    "value": "মাধ্যমিক ও উচ্চশিক্ষা অধিদপ্তর(মাউশি)",
                    "src": "http://www.dshe.gov.bd/"
                },
                {
                    "value": "মাধ্যমিক ও উচ্চ মাধ্যমিক শিক্ষা বোর্ড, রাজশাহী",
                    "src": "http://www.rajshahieducationboard.gov.bd/"
                },
                {
                    "value": "উপজেলা মাধ্যমিক শিক্ষা অফিস,বড়াইগ্রাম",
                    "src": "http://www.seo.baraigram.natore.gov.bd/"
                },
                {
                    "value": "শিক্ষা ব্যবস্থাপনা তথ্যভান্ডার(ই.এম.আই.এস-EMIS)",
                    "src": "http://emis.gov.bd/emis"
                },
                {
                    "value": "বড়াইগ্রাম উপজেলা নির্বাহী অফিস",
                    "src": "http://baraigram.natore.gov.bd/"
                },
                {
                    "value": "বাংলাদেশ শিক্ষাতথ্য ও পরিসংখ্যান ব্যুরো (ব্যানবেইস)",
                    "src": "http://www.banbeis.gov.bd/"
                },
                {
                    "value": "জেলা শিক্ষা অফিস, নাটোর।",
                    "src": "http://deo.natore.gov.bd/"
                },
                {
                    "value": "বাংলাদেশের সকল শিক্ষা প্রতিষ্ঠানের ইআইআইএন (EIIN) নম্বর",
                    "src": "http://www.bdselfstudy.com/%E0%A6%B6%E0%A6%BF%E0%A6%95%E0%A7%8D%E0%A6%B7%E0%A6%BE-%E0%A6%AA%E0%A7%8D%E0%A6%B0%E0%A6%A4%E0%A6%BF%E0%A6%B7%E0%A7%8D%E0%A6%A0%E0%A6%BE%E0%A6%A8/%E0%A6%AC%E0%A6%BE%E0%A6%82%E0%A6%B2%E0%A6%BE%E0%A6%A6%E0%A7%87%E0%A6%B6"
                }
        ]},
    collections: [
        {
            name: 'স্বাধীনতার সুবর্ণজয়ন্তী',
            img__src: '/suborno__joyonti.png',
            values: [
                {value: "সুবর্ণজয়ন্তীর কার্যক্রম", src: "/"}, 
                {value: "আদেশ / নোটিশ", src: "/"}, 
                {value: "ছবি গ্যালারি", src: "/"}, 
                {value: "ভিডিও", src: "/"},  
            ]
        },
        {
            "name": "ক্যাম্পাস",
            "img__src": "/category/campus.png",
            "values": [
                {
                    "value": "আমাদের সম্পর্কে",
                    "src": "/"
                },
                {
                    "value": "ইতিহাস",
                    "src": "/"
                },
                {
                    "value": "লক্ষ্য ও উদ্দেশ্য",
                    "src": "/"
                },
                {
                    "value": "প্রাতিষ্ঠানিক কাঠামো",
                    "src": "/"
                },
                {
                    "value": "প্রাতিষ্ঠানিক অবকাঠামো",
                    "src": "/"
                },
                {
                    "value": "শুদ্ধাচার সংক্রান্ত তথ্য",
                    "src": "/"
                }
            ]
        },
        {
            "name": "ভর্তি",
            "img__src": "/category/admit.png",
            "values": [
                {
                    "value": "কিভাবে আবেদন করতে হবে?",
                    "src": "/"
                },
                {
                    "value": "ভর্তি পরীক্ষা",
                    "src": "/"
                },
                {
                    "value": "ভর্তি নীতি",
                    "src": "/"
                },
                {
                    "value": "রেজিস্ট্রেশন সিস্টেম",
                    "src": "/"
                },
                {
                    "value": "বর্তমান শিক্ষা ব্যবস্থা",
                    "src": "/"
                },
                {
                    "value": "সেমিস্টার পরিকল্পনা",
                    "src": "/"
                }
            ]
        },
        {
            "name": "একাডেমিক",
            "img__src": "/category/academic.png",
            "values": [
                {
                    "value": "অধ্যক্ষ",
                    "src": "/"
                },
                {
                    "value": "উপাধ্যক্ষ",
                    "src": "/"
                },
                {
                    "value": "আমাদের শিক্ষকমন্ডলী",
                    "src": "/"
                },
                {
                    "value": "অফিস স্টাফ",
                    "src": "/"
                }
            ]
        },
        {
            "name": "একাডেমিক পেপার",
            "img__src": "/category/paper.png",
            "values": [
                {
                    "value": "একাডেমিক সিলেবাস",
                    "src": "/"
                },
                {
                    "value": "শ্রেণীসূচি",
                    "src": "/"
                },
                {
                    "value": "শিক্ষা বর্ষপঞ্জি",
                    "src": "/"
                }
            ]
        },
        {
            "name": "শিক্ষার্থী",
            "img__src": "/category/student.png",
            "values": [
                {
                    "value": "বেতন",
                    "src": "/"
                },
                {
                    "value": "ছাত্র ইউনিফর্ম",
                    "src": "/"
                },
                {
                    "value": "পরীক্ষার ব্যবস্থা",
                    "src": "/"
                },
                {
                    "value": "নিয়ম এবং প্রবিধান",
                    "src": "/"
                },
                {
                    "value": "আমাদের ছাত্র-ছাত্রী",
                    "src": "/"
                },
                {
                    "value": "শিক্ষার্থীদের সাফল্যের গল্প",
                    "src": "/"
                }
            ]
        },
        {
            "name": "ফলাফল",
            "img__src": "/category/result.png",
            "values": [
                {
                    "value": "একাডেমিক পরীক্ষার ফলাফল",
                    "src": "/"
                },
                {
                    "value": "বোর্ড পরীক্ষার ফলাফল",
                    "src": "/"
                }
            ]
        },
        {
            "name": "রিসোর্স",
            "img__src": "/category/resource.png",
            "values": [
                {
                    "value": "ডিজিটাল ক্লাস কনটেন্ট",
                    "src": "/"
                },
                {
                    "value": "গ্রন্থাগার",
                    "src": "/"
                },
                {
                    "value": "কম্পিউটার ল্যাব",
                    "src": "/"
                },
                {
                    "value": "খেলার মাঠ",
                    "src": "/"
                },
                {
                    "value": "সহ-পাঠক্রম সংক্রান্ত কার্যক্রম",
                    "src": "/"
                }
            ]
        },
        {
            "name": "গ্যালারী",
            "img__src": "/category/gallary.png",
            "values": [
                {
                    "value": "ফটো গ্যালারী",
                    "src": "/"
                },
                {
                    "value": "ভিডিও গ্যালারী",
                    "src": "/"
                }
            ]
        },
        {
            "name": "নোটিশ",
            "img__src": "/category/notice.png",
            "values": [
                {
                    "value": "নোটিশ",
                    "src": "/"
                },
                {
                    "value": "ডাউনলোড",
                    "src": "/"
                },
                {
                    "value": "জব প্লেসমেন্ট",
                    "src": "/"
                },
                {
                    "value": "ইভেন্টস",
                    "src": "/"
                },
                {
                    "value": "এপিএ",
                    "src": "/"
                }
            ]
        },
        {
            "name": "কোর্সসমূহ",
            "img__src": "/category/courses.png",
            "values": [
                {
                    "value": "বিজ্ঞান",
                    "src": "/"
                },
                {
                    "value": "ব্যবসায় শিক্ষা",
                    "src": "/"
                },
                {
                    "value": "মানবিক বিভাগ",
                    "src": "/"
                }
            ]
        }
    ]
}

let colleges = {
    khs:
    {
        name: 'কাশিয়াবাড়ী উচ্চ বিদ্যালয়',
        address: 'আড়গাড়া হাট,  শিবগঞ্জ, চাঁপাইনবাবগঞ্জ',
        infos: 'স্থাপিত: ১৯৬৩, কোড নং : ১৮১৭ ,  ই আই আই এন নং : ১২৪৬৩১'
    },
    mhs:
    {
        name: 'মোবারকপুর উচ্চ বিদ্যালয়',
        address: 'মোবারকপুর, শিবগঞ্জ, চাঁপাইনবাবগঞ্জ',
        infos: 'স্থাপিত: ১৯৬২, কোড নং : ১৮১৬ ,  ই আই আই এন নং : ১২৪৬২৮'
    },
    bshs:
    {
        name: 'বড়গাছী সরকারি উচ্চ বিদ্যালয়',
        address: 'বড়গাছী হাট,  ভোলাহাট,  চাঁপাইনবাবগঞ্জ',
        infos: 'স্থাপিত: ১৯৬৬, কোড নং : ১৯০৪ ,  ই আই আই এন নং :  ১২৪৩২৭'
    },
    jdc:
    {
        name: 'জামবাড়ীয়া ডিগ্রি কলেজ',
        address: 'বড়গাছী হাট, ভোলাহাট, চাঁপাইনবাবগঞ্জ',
        infos: 'স্থাপিত: ১৯৯৫, কোড নং : ১৯০৪ ,  ই আই আই এন নং :  ১২৪৩৪৯'
    },
    footerInfos: {
        postal__code: 6320,
        phone: "+8801700000",
        email: "danguli@gmail.com",
        address: "Station Bazar , Rohanpur, Chapainawabganj",
        name: "Dangulicomputers",
        sortName: "Danguli"
    }
}

export { dataArray, colleges };



// let boxes = document.querySelectorAll('.service-box');
// let collections = [];

// boxes.forEach((info) => {
//     let title = info.querySelector('h4').innerText;
//     let infos = info.querySelectorAll('.caption');

//     let values = [];

//     infos.forEach((childInfo) => {
//         let allinfo = childInfo.querySelectorAll('li > a');
//         allinfo.forEach((info) => {
//             let childItem = info.innerText;
//             values.push({value: childItem, src: '/'})
//         })
//     })

//     collections.push({name: title, img__src: '/category/paper.png', values });
// })

// console.log(collections);


// let items = document.querySelectorAll('.menu-important-link-container > .menu > .menu-item');
// let collections = [];

// items.forEach((info)  => {
//     let href = info.querySelector('a').href;
//     let name = info.querySelector('a').innerText;
//     collections.push({value: name, src: href});
// })

// console.log(collections);






